Taxi/test_billing_fin_payouts/cron/static/test_upload_to_lb/accruals_expected_data.json

{
  "consumer_id": "billing_fin_payouts.crontasks.upload_accruals_to_lb",
  "cursor_at_the_beginning": 0,
  "cursor_at_the_end": 5,
  "logbroker_entries": [
    [
      {
        "amount": "102.00",
        "bill_num": null,
        "billing_contract_id": "676914",
        "message_dt": "2022-05-30T03:00:00.000000+03:00",
        "message_id": 1,
        "message_system": "taxirew",
        "partner_currency": "RUB",
        "paysys_type_cc": "yandex",
        "reference_amount": "102.00",
        "reference_currency": "RUB",
        "service_id": 124,
        "terminalid": null,
        "transaction_dt": "2022-05-30T03:00:00.000000+03:00",
        "transaction_type": "PAYMENT",
        "yandex_reward": "0.00"
      },
      {
        "amount": "10.00",
        "bill_num": null,
        "billing_contract_id": "808972",
        "message_dt": "2022-05-30T03:00:00.000000+03:00",
        "message_id": 2,
        "message_system": "taxirew",
        "partner_currency": "BYN",
        "paysys_type_cc": "terminalid",
        "reference_amount": "10.00",
        "reference_currency": "BYN",
        "service_id": 125,
        "terminalid": "55411503",
        "transaction_dt": "2022-05-30T03:00:00.000000+03:00",
        "transaction_type": "REFUND",
        "yandex_reward": "0.00"
      },
      {
        "amount": "128.00",
        "bill_num": null,
        "billing_contract_id": "3830002",
        "message_dt": "2022-05-30T03:00:00.000000+03:00",
        "message_id": 3,
        "message_system": "taxirew",
        "partner_currency": "RUB",
        "paysys_type_cc": "psb_logist",
        "reference_amount": "128.00",
        "reference_currency": "RUB",
        "service_id": 124,
        "terminalid": null,
        "transaction_dt": "2022-05-30T03:00:00.000000+03:00",
        "transaction_type": "PAYMENT",
        "yandex_reward": "0.00"
      },
      {
        "amount": "252.00",
        "bill_num": null,
        "billing_contract_id": "317971",
        "message_dt": "2022-05-30T03:00:00.000000+03:00",
        "message_id": 4,
        "message_system": "taxirew",
        "partner_currency": "RUB",
        "paysys_type_cc": "terminalid",
        "reference_amount": "252.00",
        "reference_currency": "RUB",
        "service_id": 124,
        "terminalid": "57000589",
        "transaction_dt": "2022-05-30T03:00:00.000000+03:00",
        "transaction_type": "PAYMENT",
        "yandex_reward": "0.00"
      },
      {
        "amount": "864.52",
        "bill_num": null,
        "billing_contract_id": "3050589",
        "message_dt": "2022-05-30T03:00:00.000000+03:00",
        "message_id": 5,
        "message_system": "taxirew",
        "partner_currency": "RUB",
        "paysys_type_cc": "terminalid",
        "reference_amount": "864.52",
        "reference_currency": "RUB",
        "service_id": 124,
        "terminalid": "57000417",
        "transaction_dt": "2022-05-30T03:00:00.000000+03:00",
        "transaction_type": "PAYMENT",
        "yandex_reward": "0.48"
      }
    ]
  ],
  "topic": "/billing-accrualer/unittests/accruals/new-accrual"
}
